/* error dialog default title */
TIME_MACHINE_ERROR = "Time Machine не может завершить резервное копирование.";

/* error dialog buttons */
OK = "ОК";
PREFERENCES = "Открыть настройки Time Machine…";

/* string which is shown instead of the _SHOWPREFS message for managed prefs configurations */
MANAGED_PREFS = "Параметры Time Machine на этом компьютере задаются в Управляемых настройках. Обратитесь к системному администратору.";

/* error messages - shared with TMPref pane*/

// NO_ERROR
RESULTCODE_0_MESSAGE = "Ошибок нет.";

// BACKUP_FAILED_LAUNCH
RESULTCODE_1_MESSAGE = "Не удается запустить Time Machine.";  

// BACKUP_FAILED_SETUP
RESULTCODE_2_MESSAGE = "Не удается завершить резервное копирование. Ошибка при создании папки резервной копии."; 

// BACKUP_FAILED_TARGETVOL_UNSUPPORTED_FS
RESULTCODE_3_MESSAGE = "Резервный диск должен иметь формат Mac OS Extended (журнальный).\n\n%@"; 
RESULTCODE_3_SHOWPREFS = "Откройте параметры Time Machine и выберите другой резервный диск.";

// BACKUP_FAILED_TARGETVOL_STATFS_FAILED
RESULTCODE_4_MESSAGE = "Не удается выяснить статус резервного диска."; 

// BACKUP_FAILED_TARGETVOL_OWNERS_DISABLED
RESULTCODE_5_MESSAGE = "На резервном диске не включены владельцы. При таких настройках диск нельзя использовать для хранения резервных копий Time Machine.\n\n%@"; 
RESULTCODE_5_SHOWPREFS = "Откройте параметры Time Machine и выберите другой резервный диск.";

// BACKUP_FAILED_TARGETVOL_NOT_JOURNALED
RESULTCODE_6_MESSAGE = "Резервный диск должен иметь формат Mac OS Extended (журнальный).\n\n%@";
RESULTCODE_6_SHOWPREFS = "Откройте параметры Time Machine и выберите другой резервный диск."; 

// BACKUP_FAILED_TARGETVOL_DISK_SPACE
RESULTCODE_7_MESSAGE = "Эта резервная копия слишком большая для резервного диска. Для резервной копии требуется %@, а на жестком диске свободно только %@.\n\n%@";
RESULTCODE_7_SHOWPREFS = "Кроме пространства, необходимого для хранения резервных копий, Time Machine требуется рабочее пространство на диске резервного копирования. Откройте настройки Time Machine и выберите диск большего объема или уменьшите размер резервной копии, исключив некоторые файлы."; 

// BACKUP_FAILED_TARGETVOL_READONLY
RESULTCODE_8_MESSAGE = "Невозможно скопировать файлы на резервный диск, т.к. он доступен только для чтения.\n\n%@";
RESULTCODE_8_SHOWPREFS = "Возможно, необходимо исправить или переформатировать диск с помощью Дисковой утилиты. Если диск невозможно исправить, для хранения резервных копий необходимо использовать другой диск. Откройте настройки Time Machine и выберите другой резервный диск."; 

// BACKUP_FAILED_TARGETVOL_ACLS_DISABLED
RESULTCODE_9_MESSAGE = "На резервном диске не включены списки управления доступом (обязательный параметр).\n\n%@";
RESULTCODE_9_SHOWPREFS = "Откройте параметры Time Machine и выберите другой резервный диск."; 

// BACKUP_FAILED_PREFLIGHT_STAGE
RESULTCODE_10_MESSAGE = "Произошла ошибка при подготовке резервного копирования."; 

// BACKUP_FAILED_COPY_STAGE
RESULTCODE_11_HEADER = "Резервное копирование не выполнено, т.к. во время копирования файлов на резервный диск произошла ошибка.";
RESULTCODE_11_MESSAGE = "Проблема может быть временной. Повторите попытку резервного копирования позднее. Если проблема сохраняется, исправьте резервный диск с помощью Дисковой утилиты.";

// BACKUP_FAILED_LINK_SOURCE
RESULTCODE_12_MESSAGE = "Произошла ошибка при создании ссылок для файлов на резервном диске."; 

//  BACKUP_FAILED_TOO_MUCH_ACTIVITY
RESULTCODE_13_MESSAGE = "Слишком много файлов изменено при резервном копировании."; 

// BACKUP_FAILED_SNAPSHOT_DELETE_FAILED 
RESULTCODE_14_MESSAGE = "Произошла ошибка при попытке удалить просроченные копии с резервного диска.";

// BACKUP_FAILED_CULLING_DISABLED
RESULTCODE_15_MESSAGE = "Все просроченные копии удалены, однако на резервном диске по-прежнему недостаточно места.\n\n%@";
RESULTCODE_15_SHOWPREFS = "Откройте параметры Time Machine и выберите резервный диск большего объема.";

// BACKUP_FAILED_CULLING_DATELIMIT
RESULTCODE_16_MESSAGE = "Все просроченные копии удалены, однако на резервном диске по-прежнему недостаточно места.\n\n%@";
RESULTCODE_16_SHOWPREFS = "Откройте параметры Time Machine и выберите резервный диск большего объема."; 

// BACKUP_FAILED_TARGETVOL_NOT_SPECIFIED
RESULTCODE_17_MESSAGE = "Резервный диск не выбран.\n\n%@";
RESULTCODE_17_SHOWPREFS = "Откройте параметры Time Machine и выберите резервный диск.";

// BACKUP_FAILED_TARGETVOL_NOT_FOUND
RESULTCODE_18_MESSAGE = "Резервный диск не найден.\n\n%@";
RESULTCODE_18_SHOWPREFS = "Убедитесь, что резервный диск подключен, или откройте параметры Time Machine и выберите другой диск."; 

// BACKUP_FAILED_TARGETVOL_NOT_MOUNTED
RESULTCODE_19_MESSAGE = "Резервный диск недоступен."; 

// BACKUP_FAILED_DISK_IMAGE_NOT_CREATED
RESULTCODE_20_MESSAGE = "Не удалось создать образ резервного диска «%@» (ошибка %@)."; 

// BACKUP_FAILED_DISK_IMAGE_NOT_MOUNTED
RESULTCODE_21_MESSAGE = "Нет доступа к образу резервного диска «%@» (ошибка %@)."; 

// BACKUP_CANCELED
RESULTCODE_22_MESSAGE = "Резервное копирование отменено."; 

// BACKUP_FAILED_CASE_SENSITIVITY
RESULTCODE_23_MESSAGE = "Копируемый диск учитывает регистр, резервный диск — не учитывает.\n\n%@";
RESULTCODE_23_SHOWPREFS = "Откройте параметры Time Machine и выберите другой резервный диск или отмените копирование диска, не учитывающего регистр."; 

// BACKUP_FAILED_DUPLICATE_VOLNAMES
RESULTCODE_24_MESSAGE = "Два копируемых диска имеют одно и то же имя. Переименуйте один из них."; 

// BACKUP_FAILED_NO_SOURCE_VOLUMES
RESULTCODE_25_MESSAGE = "Нет дисков, для которых требуется резервное копирование. Возможно, все диски находятся в списке объектов, не предназначенных для резервного копирования.\n\n%@";
RESULTCODE_25_SHOWPREFS = "Чтобы отредактировать список, откройте настройки Time Machine и нажмите «Параметры».";

// BACKUP_FAILED_NETWORK_INTERRUPTION
RESULTCODE_26_HEADER = "Time Machine не удалось завершить резервное копирование из-за проблем с сетевым подключением.";
RESULTCODE_26_MESSAGE = "Убедитесь, что компьютер и диск резервного копирования подключены к одной сети и что диск резервного копирования включен, затем повторите попытку.";

// BACKUP_FAILED_DISK_INTERRUPTION
RESULTCODE_27_MESSAGE = "Возможно, резервный диск извлечен или отключен от компьютера.";

// BACKUP_FAILED_TARGETVOL_DISK_SPACE_DURING_BACKUP
RESULTCODE_28_MESSAGE = "На резервном диске неожиданно закончилось место. Time Machine попытается освободить место на диске, удалив просроченные резервные копии при следующем копировании.\n\n%@";
RESULTCODE_28_SHOWPREFS = "Откройте параметры Time Machine и выберите резервный диск большего объема или уменьшите размер резервной копии, исключив из нее часть файлов."; 

// BACKUP_FAILED_AUTHENTICATION_ERROR
RESULTCODE_29_MESSAGE = "Не удалось получить доступ к сетевому резервному диску из-за неверного имени пользователя или пароля.\n\n%@";
RESULTCODE_29_SHOWPREFS = "Откройте параметры Time Machine, выберите сетевой резервный диск и повторно введите имя пользователя и пароль.";

// BACKUP_FAILED_UNABLE_TO_REUSE_BACKUP
RESULTCODE_30_MESSAGE = "Произошла ошибка при попытке повторно использовать резервную копию «%@».";

// BACKUP_FAILED_DISK_IMAGE_BUSY
RESULTCODE_31_MESSAGE = "Образ резервного диска «%@» уже используется.";

// BACKUP_FAILED_DISK_IMAGE_NOT_FOUND
RESULTCODE_32_MESSAGE = "Образ резервного диска «%@» не найден.";

// BACKUP_FAILED_CLOCK_WRONG
RESULTCODE_33_MESSAGE = "Дата и время в системе установлены неверно.";

// BACKUP_FAILED_NO_PRIMARY_NETWORK_INTERFACE
RESULTCODE_34_MESSAGE = "У этого компьютера отсутствует первичный сетевой интерфейс.";

// BACKUP_FAILED_BOOT_COOKIE_NOT_FOUND
RESULTCODE_35_MESSAGE = "Time Machine не может найти часть параметров.\n\n%@";
RESULTCODE_35_SHOWPREFS = "Чтобы восстановить параметры Time Machine, откройте окно параметров и заново укажите резервный диск.";

// BACKUP_FAILED_DESTINATION_COOKIE_NOT_FOUND
RESULTCODE_36_MESSAGE = "Time Machine не может найти часть параметров на резервном диске «%@».\n\nУбедитесь в том, что резервный диск подключен и что нет других подключенных дисков с тем же именем.\n\n%@";
RESULTCODE_36_SHOWPREFS = "Чтобы восстановить параметры Time Machine, откройте окно параметров и заново укажите резервный диск.";

// BACKUP_FAILED_DISK_SOURCE_INTERRUPTION
RESULTCODE_37_MESSAGE = "Возможно, один из копируемых дисков извлечен или отключен от компьютера.";

// BACKUP_FAILED_TARGETIMAGE_READONLY
RESULTCODE_38_MESSAGE = "Time Machine не удается использовать образ диск, т.к. запись на диск невозможна.";

// BACKUP_HC_FAILED_TARGETVOL_RESOLUTION_FAILED
RESULTCODE_40_HEADER = "Time Machine не удалось проверить Ваши резервные копии, т.к. резервный диск недоступен.";
RESULTCODE_40_MESSAGE = "Убедитесь, что компьютер и диск резервного копирования подключены к одной сети и что диск резервного копирования включен, затем повторите попытку резервного копирования.";

// BACKUP_HC_FAILED_TARGETVOL_READONLY
RESULTCODE_41_HEADER = "Time Machine не удалось проверить Ваши резервные копии.";
RESULTCODE_41_MESSAGE = "Диск резервного копирования доступен «только для чтения».";

// BACKUP_HC_VERIFICATION_INTERRUPTED
RESULTCODE_42_HEADER = "Time Machine не удалось проверить Ваши резервные копии, т.к. процесс проверки был прерван.";
RESULTCODE_42_MESSAGE = "Причиной прерываний обычно являются сетевые проблемы. Повторите попытку, когда сетевые проблемы будут разрешены.";

// BACKUP_FAILED_TO_ABANDON_IMAGE
RESULTCODE_43_MESSAGE = "Time Machine не удалось переместить существующий образ диска резервного копирования «%@»";

// BACKUP_FAILED_TO_DELETE_IMAGE
RESULTCODE_44_MESSAGE = "Time Machine не удалось удалить образ диска резервного копирования «%@»";

// BACKUP_FAILED_UNKNOWN
RESULTCODE_999_MESSAGE = "Код ошибки: %@";

// BACKUP_WARNING_LOW_DISK_MESSAGE
RESULTCODE_1000_HEADER = "Резервный диск почти заполнен.";
RESULTCODE_1000_MESSAGE = "Если резервный диск заполнен, Time Machine удалит старые резервные копии, чтобы освободить место.\n\n%@";
RESULTCODE_1000_SHOWPREFS = "Если Вы хотите оставить все старые резервные копии, откройте параметры Time Machine и выберите новый резервный диск.";

// BACKUP_WARNING_THINNING_START
RESULTCODE_1001_HEADER = "Резервный диск заполнен.";
RESULTCODE_1001_MESSAGE = "Time Machine удалила одну или несколько резервных копий, чтобы освободить место на диске. Самая старая из оставшихся копий: %@\n\n%@";
RESULTCODE_1001_SHOWPREFS = "Если старые резервные копии нужно оставить, откройте параметры Time Machine и выберите другой резервный диск."; 
RESULTCODE_1001_CHECKBOX = "Больше не показывать это предупреждение.";

// BACKUP_WARNING_NO_RECENT_BACKUPS
RESULTCODE_1002_MESSAGE = "Time Machine не выполняла резервное копирование компьютера %@ дн.\n\n%@"; 
RESULTCODE_1002_SHOWPREFS = "Убедитесь, что резервный диск доступен, или откройте параметры Time Machine и выберите новый диск.";

// BACKUP_WARNING_REUSE_BACKUPS
RESULTCODE_1003_HEADER = "Использовать резервную копию «%@» для этого компьютера повторно?";
RESULTCODE_1003_MESSAGE = "Эта копия была создана на другом компьютере. Если Вы используете ее повторно, ее нельзя будет использовать на исходном компьютере.";
REUSE_BACKUP_BUTTON = "Повторное использование копии";
CREATE_NEW_BACKUP_BUTTON = "Создать новую копию";
ASK_LATER_BUTTON = "Не создавать";

// BACKUP_WARNING_FIRMWARE 
RESULTCODE_1004_HEADER = "Обновление доступно для «%@».";
RESULTCODE_1004_MESSAGE = "Данное обновление повышает уровень надежности Time Capsule. Для установки обновления откройте AirPort-Утилиту. Возможно, потребуется предоставить пароль Time Capsule для «%@».";
REMIND_LATER_BUTTON = "Обновить позднее";
AIRPORT_UTILITY_BUTTON = "Открыть AirPort-Утилиту…";

// BACKUP_WARNING_DELETE_IMAGE 
RESULTCODE_1006_HEADER = "Time Machine завершила проверку резервных копий. Для повышения надежности Time Machine требуется создать новую резервную копию.";
RESULTCODE_1006_MESSAGE = "Для создания новой резервной копии нажмите «Создать сейчас». История существующей резервной копии будет удалена. Это может занять несколько часов.\n\nПри выборе «Создать позже» Вы получите напоминание завтра. В течение этого времени Time Machine не будет создавать резервных копий.";
CREATE_RECOVERY_IMAGE_NOW_BUTTON = "Создать сейчас";
CREATE_RECOVERY_IMAGE_ASK_LATER_BUTTON = "Создать позже";

// BACKUP_WARNING_TARGETVOL_CHANGED
RESULTCODE_1008_HEADER = "Идентификация диска резервного копирования изменилась со времени создания предыдущей резервной копии.";
RESULTCODE_1008_MESSAGE = "Возможно, диск был заменен или стерт, или кто-то пытается незаконно создать резервную копию Вашего компьютера не на Вашем диске.";
BACKUP_WARNING_TARGETVOL_CHANGED_OK_BUTTON = "Использовать этот диск";
BACKUP_WARNING_TARGETVOL_CHANGED_CANCEL_BUTTON = "Не создавать";

// UNITS
KB = "КБ";
MB = "МБ";
GB = "ГБ";
TB = "ТБ";
